In [2]:
import pandas as pd
import numpy as np

In [7]:
data = np.arange(0, 50, 10)
data

array([ 0, 10, 20, 30, 40])

In [8]:
a = pd.Series(data, index=['a','b','c','d','e']) #명시적 인덱싱
a

a     0
b    10
c    20
d    30
e    40
dtype: int32

In [9]:
b = pd.Series(data)
b

0     0
1    10
2    20
3    30
4    40
dtype: int32

In [10]:
a['b']

10

In [13]:
a.loc['b'] #명시적으로 서항해준 인덱싱

10

In [14]:
a.iloc[1] #순서

10

In [16]:
a

a     0
b    10
c    20
d    30
e    40
dtype: int32

In [21]:
a + 10
a - 10
a * 10
a ** 2
a / 5
a // 5
a % 3

a    0
b    1
c    2
d    0
e    1
dtype: int32

In [22]:
a

a     0
b    10
c    20
d    30
e    40
dtype: int32

In [25]:
a > 15

a    False
b    False
c     True
d     True
e     True
dtype: bool

In [26]:
a [a > 15]

c    20
d    30
e    40
dtype: int32

### 집계함수

In [27]:
a.add(100)

a    100
b    110
c    120
d    130
e    140
dtype: int32

In [28]:
a.sub(100)

a   -100
b    -90
c    -80
d    -70
e    -60
dtype: int32

In [29]:
a.mul(100)

a       0
b    1000
c    2000
d    3000
e    4000
dtype: int32

In [30]:
a.div(100)

a    0.0
b    0.1
c    0.2
d    0.3
e    0.4
dtype: float64

In [32]:
a.mod(3)

a    0
b    1
c    2
d    0
e    1
dtype: int32

In [33]:
a.min()

0

In [34]:
a.max()

40

In [35]:
a.sum()

100

In [36]:
a.mean()

20.0

In [37]:
a.median()

20.0

In [38]:
a.std()

15.811388300841896

In [39]:
a.var()

250.0

# DataFrame

In [48]:
rawData = np.random.randint(50, 100, size = (4, 3))
rawData

array([[66, 70, 71],
       [68, 81, 75],
       [99, 84, 88],
       [95, 81, 50]])

In [85]:
df = pd.DataFrame(rawData,
                  index = ['1반', '2반', '1반', '2반'],
                  columns = ['국', '영', '수'])
df

     국   영   수
1반  66  70  71
2반  68  81  75
1반  99  84  88
2반  95  81  50

In [50]:
#df[0] -> Error
df['국']

1반    66
2반    68
1반    99
2반    95
Name: 국, dtype: int32

In [53]:
df

     국   영   수
1반  66  70  71
2반  68  81  75
1반  99  84  88
2반  95  81  50

In [88]:
df['평균'] = round((df['국'] + df['영'] + df['수'])/3, 2)
df

     국   영   수     평균
1반  66  70  71  69.00
2반  68  81  75  74.67
1반  99  84  88  90.33
2반  95  81  50  75.33

In [89]:
df['na'] = np.nan
df

     국   영   수     평균  na
1반  66  70  71  69.00 NaN
2반  68  81  75  74.67 NaN
1반  99  84  88  90.33 NaN
2반  95  81  50  75.33 NaN

In [90]:
del df['na'] #결측치 처리
df

     국   영   수     평균
1반  66  70  71  69.00
2반  68  81  75  74.67
1반  99  84  88  90.33
2반  95  81  50  75.33

In [91]:
df[df.평균 > 75]

     국   영   수     평균
1반  99  84  88  90.33
2반  95  81  50  75.33

In [92]:
df = df.drop(['평균'], axis = 'columns')
df

     국   영   수
1반  66  70  71
2반  68  81  75
1반  99  84  88
2반  95  81  50

# 결측값 처리

In [93]:
df = df.astype('float64')
df

       국     영     수
1반  66.0  70.0  71.0
2반  68.0  81.0  75.0
1반  99.0  84.0  88.0
2반  95.0  81.0  50.0

In [94]:
df['수'][2] = np.nan
df

       국     영     수
1반  66.0  70.0  71.0
2반  68.0  81.0  75.0
1반  99.0  84.0   NaN
2반  95.0  81.0  50.0

In [95]:
df.dropna(axis=0) #원본은 그대로, 원본수정을 원하면 inplace = True

       국     영     수
1반  66.0  70.0  71.0
2반  68.0  81.0  75.0
2반  95.0  81.0  50.0

In [96]:
df

       국     영     수
1반  66.0  70.0  71.0
2반  68.0  81.0  75.0
1반  99.0  84.0   NaN
2반  95.0  81.0  50.0

In [97]:
df.dropna(axis = 1) #원본이 사라지는 것은 아님

       국     영
1반  66.0  70.0
2반  68.0  81.0
1반  99.0  84.0
2반  95.0  81.0

In [98]:
df

       국     영     수
1반  66.0  70.0  71.0
2반  68.0  81.0  75.0
1반  99.0  84.0   NaN
2반  95.0  81.0  50.0

In [99]:
df.fillna('hello')

       국     영      수
1반  66.0  70.0   71.0
2반  68.0  81.0   75.0
1반  99.0  84.0  hello
2반  95.0  81.0   50.0

In [100]:
df.fillna(0)

       국     영     수
1반  66.0  70.0  71.0
2반  68.0  81.0  75.0
1반  99.0  84.0   0.0
2반  95.0  81.0  50.0

In [102]:
df.fillna(df.mean())

       국     영          수
1반  66.0  70.0  71.000000
2반  68.0  81.0  75.000000
1반  99.0  84.0  65.333333
2반  95.0  81.0  50.000000

# Multi Index

In [103]:
df

       국     영     수
1반  66.0  70.0  71.0
2반  68.0  81.0  75.0
1반  99.0  84.0   NaN
2반  95.0  81.0  50.0

In [104]:
df.T #row 와 column 뒤바꿈

     1반    2반    1반    2반
국  66.0  68.0  99.0  95.0
영  70.0  81.0  84.0  81.0
수  71.0  75.0   NaN  50.0

In [105]:
df

       국     영     수
1반  66.0  70.0  71.0
2반  68.0  81.0  75.0
1반  99.0  84.0   NaN
2반  95.0  81.0  50.0

In [119]:
df.index = [['1학년','2학년','1학년','2학년'], ['1반','1반','2반','2반']]
df

          언어          수리
           국     영     수
1학년 1반  66.0  70.0  71.0
2학년 1반  68.0  81.0  75.0
1학년 2반  99.0  84.0   NaN
2학년 2반  95.0  81.0  50.0

In [120]:
df.columns = [['언어','언어','수리'],['국','영','수']]
df

          언어          수리
           국     영     수
1학년 1반  66.0  70.0  71.0
2학년 1반  68.0  81.0  75.0
1학년 2반  99.0  84.0   NaN
2학년 2반  95.0  81.0  50.0

In [121]:
df['언어']

           국     영
1학년 1반  66.0  70.0
2학년 1반  68.0  81.0
1학년 2반  99.0  84.0
2학년 2반  95.0  81.0

In [122]:
df['언어']['국'] #인덱스를 통해 출력

1학년  1반    66.0
2학년  1반    68.0
1학년  2반    99.0
2학년  2반    95.0
Name: 국, dtype: float64

In [123]:
df.iloc[0] #위치로 출력

언어  국    66.0
    영    70.0
수리  수    71.0
Name: (1학년, 1반), dtype: float64

In [124]:
df.loc['1학년']

      언어          수리
       국     영     수
1반  66.0  70.0  71.0
2반  99.0  84.0   NaN

In [125]:
df.loc['1학년'].loc['1반']

언어  국    66.0
    영    70.0
수리  수    71.0
Name: 1반, dtype: float64

# 데이터 사전 분석

In [127]:
df

          언어          수리
           국     영     수
1학년 1반  66.0  70.0  71.0
2학년 1반  68.0  81.0  75.0
1학년 2반  99.0  84.0   NaN
2학년 2반  95.0  81.0  50.0

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 4 entries, ('1학년', '1반') to ('2학년', '2반')
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   (언어, 국)  4 non-null      float64
 1   (언어, 영)  4 non-null      float64
 2   (수리, 수)  3 non-null      float64
dtypes: float64(3)
memory usage: 384.0+ bytes

In [129]:
df.head() # 맨 앞부터 5개의 값까지 보여줌

          언어          수리
           국     영     수
1학년 1반  66.0  70.0  71.0
2학년 1반  68.0  81.0  75.0
1학년 2반  99.0  84.0   NaN
2학년 2반  95.0  81.0  50.0

In [130]:
df.tail() #맨 뒤부터 5개의 값까지 보여줌

          언어          수리
           국     영     수
1학년 1반  66.0  70.0  71.0
2학년 1반  68.0  81.0  75.0
1학년 2반  99.0  84.0   NaN
2학년 2반  95.0  81.0  50.0

In [131]:
df.dtypes

언어  국    float64
    영    float64
수리  수    float64
dtype: object

In [132]:
df.describe()

              언어                    수리
               국          영          수
count   4.000000   4.000000   3.000000
mean   82.000000  79.000000  65.333333
std    17.416467   6.164414  13.428825
min    66.000000  70.000000  50.000000
25%    67.500000  78.250000  60.500000
50%    81.500000  81.000000  71.000000
75%    96.000000  81.750000  73.000000
max    99.000000  84.000000  75.000000

In [133]:
df.isnull() #결측치는 True로 나옴

           언어            수리
            국      영      수
1학년 1반  False  False  False
2학년 1반  False  False  False
1학년 2반  False  False   True
2학년 2반  False  False  False

In [134]:
df.isnull().sum()

언어  국    0
    영    0
수리  수    1
dtype: int64

## 값의 연결

In [136]:
a = pd.DataFrame(np.arange(1, 10).reshape(3, 3))
a

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [137]:
b = pd.Series(np.arange(10, 40, 10))
b

0    10
1    20
2    30
dtype: int32

In [138]:
pd.concat([a, b], axis=1)

   0  1  2   0
0  1  2  3  10
1  4  5  6  20
2  7  8  9  30

In [139]:
pd.concat([a, b], axis=1, ignore_index = True)

   0  1  2   3
0  1  2  3  10
1  4  5  6  20
2  7  8  9  30

In [140]:
a.append(b, ignore_index = True)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  20  30